dominiczy/satelliteplatform/processors/msp430/msp430_isa (dominic zijlstra's conflicted copy 2015-03-27).cpp
//!Instruction bis_16iaim behavior method.
void ac_behavior( bis_16iaim ){
  mode = _16iaim;
  BIS(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction bis_32idst behavior method.
void ac_behavior( bis_32idst ){
  mode = _32idst;
		if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  BIS(sreg, bw, dreg, oset, 0, 0, DM, RB, RB.read(sreg), DM.read(oset));
}

//!Instruction bis_32isrc behavior method.
void ac_behavior( bis_32isrc ){
  mode = _32isrc;
	if (sreg != 2) // then whe are not in the absolute mode for source
    oset = (uint16_t)(oset + RB.read(sreg));
  BIS(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(oset), RB.read(dreg));
}

//!Instruction bis_32imm behavior method.
void ac_behavior( bis_32imm ){
  mode = _32imm;
  BIS(sreg, bw, dreg, oset, 0, 0, DM, RB, oset, RB.read(dreg));
}

//!Instruction bis_32iaim behavior method.
void ac_behavior( bis_32iaim ){
  mode = _32iaim;
	if (dreg != 2)
     oset = (uint16_t)(oset + RB.read(dreg));
  BIS(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction bis_32irm behavior method.
void ac_behavior( bis_32irm ){
  mode = _32irm;
	if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  BIS(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction bis_48idm behavior method.
void ac_behavior( bis_48idm ){
  mode = _48idm;
  if ((sreg != SR && dreg != SR)) {// then we are using indexed mode
    if (constant.mode) 
      odst = (uint16_t)(osrc + RB.read(dreg));
    else {
      odst = (uint16_t)(odst + RB.read(dreg));
      osrc = (uint16_t)(osrc + RB.read(sreg));
    }
  }

  if (constant.mode && dreg == SR)
    odst = (uint16_t)(osrc);

  BIS(sreg, bw, dreg, 0, osrc, odst, DM, RB, DM.read(osrc), DM.read(odst));
}

//!Instruction bis_48imm behavior method.
void ac_behavior( bis_48imm ){
  mode = _48imm;
	if (dreg != 2)
    odst = (uint16_t)(odst + RB.read(dreg));
  BIS(sreg, bw, dreg, 0, osrc, odst, DM, RB, osrc, DM.read(odst));
}
//@}

/**
 * 
 * @defgroup BIT BIT instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//****************** BIT ************************
//!Instruction bit_16rm behavior method.
void ac_behavior( bit_16rm ){
  mode = _16rm;
  BIT(sreg, bw, dreg, 0, 0, 0, DM, RB, RB.read(sreg), RB.read(dreg));
}

//!Instruction bit_16irm behavior method.
void ac_behavior( bit_16irm ){
  mode = _16irm;
  BIT(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction bit_16iaim behavior method.
void ac_behavior( bit_16iaim ){
  mode = _16iaim;
  BIT(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction bit_32idst behavior method.
void ac_behavior( bit_32idst ){
  mode = _32idst;
		if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  BIT(sreg, bw, dreg, oset, 0, 0, DM, RB, RB.read(sreg), DM.read(oset));
}

//!Instruction bit_32isrc behavior method.
void ac_behavior( bit_32isrc ){
  mode = _32isrc;
	if (sreg != 2) // then whe are not in the absolute mode for source
    oset = (uint16_t)(oset + RB.read(sreg));
  BIT(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(oset), RB.read(dreg));
}

//!Instruction bit_32imm behavior method.
void ac_behavior( bit_32imm ){
  mode = _32imm;
  BIT(sreg, bw, dreg, oset, 0, 0, DM, RB, oset, RB.read(dreg));
}

//!Instruction bit_32iaim behavior method.
void ac_behavior( bit_32iaim ){
  mode = _32iaim;
	if (dreg != 2)
     oset = (uint16_t)(oset + RB.read(dreg));
  BIT(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction bit_32irm behavior method.
void ac_behavior( bit_32irm ){
  mode = _32irm;
	if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  BIT(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction bit_48idm behavior method.
void ac_behavior( bit_48idm ){
  mode = _48idm;
  if ((sreg != SR && dreg != SR)) {// then we are using indexed mode
    if (constant.mode) 
      odst = (uint16_t)(osrc + RB.read(dreg));
    else {
      odst = (uint16_t)(odst + RB.read(dreg));
      osrc = (uint16_t)(osrc + RB.read(sreg));
    }    
  }

  if (constant.mode && dreg == SR)
    odst = (uint16_t)(osrc);
  
  BIT(sreg, bw, dreg, 0, osrc, odst, DM, RB, DM.read(osrc), DM.read(odst));
}

//!Instruction bit_48imm behavior method.
void ac_behavior( bit_48imm ){
  mode = _48imm;
	if (dreg != 2)
    odst = (uint16_t)(odst + RB.read(dreg));
  BIT(sreg, bw, dreg, 0, osrc, odst, DM, RB, osrc, DM.read(odst));
}
//@}

/**
 * 
 * @defgroup CMP CMP instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//****************** CMP ************************
//!Instruction cmp_16rm behavior method.
void ac_behavior( cmp_16rm ){
  mode = _16rm;
  CMP(sreg, bw, dreg, 0, 0, 0, DM, RB, RB.read(sreg), RB.read(dreg));
}

//!Instruction cmp_16irm behavior method.
void ac_behavior( cmp_16irm ){
  mode = _16irm;
  CMP(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction cmp_16iaim behavior method.
void ac_behavior( cmp_16iaim ){
  mode = _16iaim;
  CMP(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction cmp_32idst behavior method.
void ac_behavior( cmp_32idst ){
  mode = _32idst;
		if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  CMP(sreg, bw, dreg, oset, 0, 0, DM, RB, RB.read(sreg), DM.read(oset));
}

//!Instruction cmp_32isrc behavior method.
void ac_behavior( cmp_32isrc ){
  mode = _32isrc;
	if (sreg != 2) // then whe are not in the absolute mode for source
    oset = (uint16_t)(oset + RB.read(sreg));
  CMP(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(oset), RB.read(dreg));
}

//!Instruction cmp_32imm behavior method.
void ac_behavior( cmp_32imm ){
  mode = _32imm;
  CMP(sreg, bw, dreg, oset, 0, 0, DM, RB, oset, RB.read(dreg));
}

//!Instruction cmp_32iaim behavior method.
void ac_behavior( cmp_32iaim ){
  mode = _32iaim;
	if (dreg != 2)
     oset = (uint16_t)(oset + RB.read(dreg));
  CMP(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction cmp_32irm behavior method.
void ac_behavior( cmp_32irm ){
  mode = _32irm;
	if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  CMP(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction cmp_48idm behavior method.
void ac_behavior( cmp_48idm ){
  mode = _48idm;
  if ((sreg != SR && dreg != SR)) {// then we are using indexed mode
    if (constant.mode) 
      odst = (uint16_t)(osrc + RB.read(dreg));
    else {
      odst = (uint16_t)(odst + RB.read(dreg));
      osrc = (uint16_t)(osrc + RB.read(sreg));
    }    
  }

  if (constant.mode && dreg == SR)
    odst = (uint16_t)(osrc);

  CMP(sreg, bw, dreg, 0, osrc, odst, DM, RB, DM.read(osrc), DM.read(odst));
}

//!Instruction cmp_48imm behavior method.
void ac_behavior( cmp_48imm ){
  mode = _48imm;
	if (dreg != 2)
    odst = (uint16_t)(odst + RB.read(dreg));
  CMP(sreg, bw, dreg, 0, osrc, odst, DM, RB, osrc, DM.read(odst));
}
//@}

/**
 * 
 * @defgroup DADD DADD instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//****************** DADD ************************
//!Instruction dadd_16rm behavior method.
void ac_behavior( dadd_16rm ){
  mode = _16rm;
  DADD(sreg, bw, dreg, 0, 0, 0, DM, RB, RB.read(sreg), RB.read(dreg));
}

//!Instruction dadd_16irm behavior method.
void ac_behavior( dadd_16irm ){
  mode = _16irm;
  DADD(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction dadd_16iaim behavior method.
void ac_behavior( dadd_16iaim ){
  mode = _16iaim;
  DADD(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction dadd_32idst behavior method.
void ac_behavior( dadd_32idst ){
  mode = _32idst;
		if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  DADD(sreg, bw, dreg, oset, 0, 0, DM, RB, RB.read(sreg), DM.read(oset));
}

//!Instruction dadd_32isrc behavior method.
void ac_behavior( dadd_32isrc ){
  mode = _32isrc;
	if (sreg != 2) // then whe are not in the absolute mode for source
    oset = (uint16_t)(oset + RB.read(sreg));
  DADD(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(oset), RB.read(dreg));
}

