dominiczy/satelliteplatform/processors/msp430/msp430_isa (dominic zijlstra's conflicted copy 2015-03-27).cpp
  SUBC(sreg, bw, dreg, 0, osrc, odst, DM, RB, DM.read(osrc), DM.read(odst));
}

//!Instruction subc_48imm behavior method.
void ac_behavior( subc_48imm ){
  mode = _48imm;
	if (dreg != 2)
    odst = (uint16_t)(odst + RB.read(dreg));
  SUBC(sreg, bw, dreg, 0, osrc, odst, DM, RB, osrc, DM.read(odst));
}
//@}

/**
 * 
 * @defgroup XOR XOR instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//****************** XOR ************************
//!Instruction xor_16rm behavior method.
void ac_behavior( xor_16rm ){
  mode = _16rm;
  XOR(sreg, bw, dreg, 0, 0, 0, DM, RB, RB.read(sreg), RB.read(dreg));
}

//!Instruction xor_16irm behavior method.
void ac_behavior( xor_16irm ){
  mode = _16irm;
  XOR(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction xor_16iaim behavior method.
void ac_behavior( xor_16iaim ){
  mode = _16iaim;
  XOR(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction xor_32idst behavior method.
void ac_behavior( xor_32idst ){
  mode = _32idst;
		if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  XOR(sreg, bw, dreg, oset, 0, 0, DM, RB, RB.read(sreg), DM.read(oset));
}

//!Instruction xor_32isrc behavior method.
void ac_behavior( xor_32isrc ){
  mode = _32isrc;
	if (sreg != 2) // then whe are not in the absolute mode for source
    oset = (uint16_t)(oset + RB.read(sreg));
  XOR(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(oset), RB.read(dreg));
}

//!Instruction xor_32imm behavior method.
void ac_behavior( xor_32imm ){
  mode = _32imm;
  XOR(sreg, bw, dreg, oset, 0, 0, DM, RB, oset, RB.read(dreg));
}

//!Instruction xor_32iaim behavior method.
void ac_behavior( xor_32iaim ){
  mode = _32iaim;
  if (dreg != 2) 
    oset = (uint16_t)(oset + RB.read(dreg));
  XOR(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction xor_32irm behavior method.
void ac_behavior( xor_32irm ){
  mode = _32irm;
	if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  XOR(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction xor_48idm behavior method.
void ac_behavior( xor_48idm ){
  mode = _48idm;
  if ((sreg != SR && dreg != SR)) {// then we are using indexed mode
    if (constant.mode) 
      odst = (uint16_t)(osrc + RB.read(dreg));
    else {
      odst = (uint16_t)(odst + RB.read(dreg));
      osrc = (uint16_t)(osrc + RB.read(sreg));
    }
  }

  if (constant.mode && dreg == SR)
    odst = (uint16_t)(osrc);

  XOR(sreg, bw, dreg, 0, osrc, odst, DM, RB, DM.read(osrc), DM.read(odst));
}

//!Instruction xor_48imm behavior method.
void ac_behavior( xor_48imm ){
  mode = _48imm;
	if (dreg != 2)
    odst = (uint16_t)(odst + RB.read(dreg));
  XOR(sreg, bw, dreg, 0, osrc, odst, DM, RB, osrc, DM.read(odst));
}
//@}
//@}
//*****************************************************
// Single Operand instructions
//*****************************************************

/**
 * 
 * @defgroup SINGLE SINGLE operand instruction 
 * 
 * @brief All SINGLE operand instructions
 * @{ 
 */

/**
 * 
 * @defgroup RRC RRC instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//**********************RRC**********************
//!Instruction rrc_16rm behavior method.
void ac_behavior( rrc_16rm ){
  mode = _16rm;
  RRC(bw, sreg, 0, DM, RB, RB.read(sreg));
}

//!Instruction rrc_16irm behavior method.
void ac_behavior( rrc_16irm ){
  // trick to save on memory
  // simplification 
  // here indexed register mode is used to 
  // save directly into memory using write_back method 
  mode = _32irm;
  RRC(bw, sreg, RB.read(sreg), DM, RB, DM.read(RB.read(sreg)));
}

//!Instruction rrc_16iaim behavior method.
void ac_behavior( rrc_16iaim ){
  mode = _16iaim;
  RRC(bw, sreg, 0, DM, RB, RB.read(sreg));
}

//!Instruction rrc_32sm behavior method.
void ac_behavior( rrc_32sm ){
  mode = _32irm;
  RRC(bw, sreg, oset, DM, RB, DM.read(RB.read(sreg)));
}

//!Instruction rrc_32am behavior method.
void ac_behavior( rrc_32am ){
  mode = _32irm;
  RRC(bw, sreg, oset, DM, RB, DM.read(RB.read(sreg)));
}

//!Instruction rrc_32imm behavior method.
void ac_behavior( rrc_32imm ){
  printf("Unpredictable program operation");
  printf("Annulling instruction execution");
  ac_annul();  
}

//!Instruction rrc_32im behavior method.
void ac_behavior( rrc_32im ){
  mode = _32irm;
  RRC(bw, sreg, oset, DM, RB, DM.read(RB.read(sreg)));
}
//@}

/**
 * 
 * @defgroup SWPB SWPB instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//**********************SWPB**********************
//!Instruction swpb_16rm behavior method.
void ac_behavior( swpb_16rm ){
  mode = _16rm;
  SWPB(bw, sreg, 0, DM, RB, RB.read(sreg));
}

//!Instruction swpb_16irm behavior method.
void ac_behavior( swpb_16irm ){
  // trick to save on memory
  // simplification 
  // here indexed register mode is used to 
  // save directly into memory using write_back method 
  mode = _32irm;
  SWPB(bw, sreg, RB.read(sreg), DM, RB, DM.read(RB.read(sreg)));
}

//!Instruction swpb_16iaim behavior method.
void ac_behavior( swpb_16iaim ){
  mode = _16iaim;
  SWPB(bw, sreg, 0, DM, RB, RB.read(sreg));
}

//!Instruction swpb_32sm behavior method.
void ac_behavior( swpb_32sm ){
  mode = _32irm;
  SWPB(bw, sreg, oset, DM, RB, DM.read(RB.read(sreg)));
}

//!Instruction swpb_32am behavior method.
void ac_behavior( swpb_32am ){
  mode = _32irm;
  SWPB(bw, sreg, oset, DM, RB, DM.read(RB.read(sreg)));
}

//!Instruction swpb_32imm behavior method.
void ac_behavior( swpb_32imm ){
  printf("Unpredictable program operation");
  printf("Annulling instruction execution");
  ac_annul();  
}

//!Instruction swpb_32im behavior method.
void ac_behavior( swpb_32im ){
  mode = _32irm;
  SWPB(bw, sreg, oset, DM, RB, DM.read(RB.read(sreg)));
}
//@}

/**
 * 
 * @defgroup RRA RRA instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//**********************RRA**********************
//!Instruction rra_16rm behavior method.
void ac_behavior( rra_16rm ){
  mode = _16rm;
  RRA(bw, sreg, 0, DM, RB, RB.read(sreg));
}

//!Instruction rra_16irm behavior method.
void ac_behavior( rra_16irm ){
  // trick to save on memory
  // simplification 
  // here indexed register mode is used to 
  // save directly into memory using write_back method 
  mode = _32irm;
  RRA(bw, sreg, RB.read(sreg), DM, RB, DM.read(RB.read(sreg)));
}

//!Instruction rra_16iaim behavior method.
void ac_behavior( rra_16iaim ){
  mode = _16iaim;
  RRA(bw, sreg, 0, DM, RB, RB.read(sreg));
}

//!Instruction rra_32sm behavior method.
void ac_behavior( rra_32sm ){
  mode = _32irm;
  RRA(bw, sreg, oset, DM, RB, DM.read(RB.read(sreg)));
}

//!Instruction rra_32am behavior method.
void ac_behavior( rra_32am ){
  mode = _32irm;
  RRA(bw, sreg, oset, DM, RB, DM.read(RB.read(sreg)));
}

//!Instruction rra_32imm behavior method.
void ac_behavior( rra_32imm ){
  printf("Unpredictable program operation");
  printf("Annulling instruction execution");
  ac_annul();  
}

//!Instruction rra_32im behavior method.
void ac_behavior( rra_32im ){
  mode = _32irm;
  RRA(bw, sreg, oset, DM, RB, DM.read(RB.read(sreg)));
}
//@}

/**
 * 
 * @defgroup SXT SXT instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//**********************SXT**********************
//!Instruction sxt_16rm behavior method.
void ac_behavior( sxt_16rm ){
  mode = _16rm;
  SXT(bw, sreg, 0, DM, RB, RB.read(sreg));
}

//!Instruction sxt_16irm behavior method.
void ac_behavior( sxt_16irm ){
  // trick to save on memory
  // simplification 
  // here indexed register mode is used to 
  // save directly into memory using write_back method
  // RB.read(sreg) -> oset
  mode = _32irm;
  SXT(bw, sreg, RB.read(sreg), DM, RB, DM.read(RB.read(sreg)));
}

//!Instruction sxt_16iaim behavior method.
void ac_behavior( sxt_16iaim ){
  mode = _16iaim;
  SXT(bw, sreg, 0, DM, RB, RB.read(sreg));
}

//!Instruction sxt_32sm behavior method.
void ac_behavior( sxt_32sm ){
  mode = _32irm;
  SXT(bw, sreg, oset, DM, RB, DM.read(RB.read(sreg)));
}

//!Instruction sxt_32am behavior method.
void ac_behavior( sxt_32am ){
  mode = _32irm;
  SXT(bw, sreg, oset, DM, RB, DM.read(RB.read(sreg)));
}

//!Instruction sxt_32imm behavior method.
void ac_behavior( sxt_32imm ){
  printf("Unpredictable program operation");
  printf("Annulling instruction execution");
  ac_annul();  
}

//!Instruction sxt_32im behavior method.
void ac_behavior( sxt_32im ){
  mode = _32irm;
  if (sreg != 2) 
    oset = (uint16_t)(oset + RB.read(sreg));
  SXT(bw, sreg, oset, DM, RB, DM.read(oset));
}
//@}

/**
 * 
 * @defgroup PUSH PUSH instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//**********************PUSH**********************
//!Instruction push_16rm behavior method.
void ac_behavior( push_16rm ){
  mode = _16rm;
  PUSH(bw, sreg, 0, DM, RB);
}

//!Instruction push_16irm behavior method.
void ac_behavior( push_16irm ){
  mode = _16irm;
  PUSH(bw, sreg, 0, DM, RB);
}

