dominiczy/satelliteplatform/processors/msp430/msp430_isa (dominic zijlstra's conflicted copy 2015-03-27).cpp
//!Instruction push_16iaim behavior method.
void ac_behavior( push_16iaim ){
  mode = _16iaim;
  PUSH(bw, sreg, 0, DM, RB);
}

//!Instruction push_32sm behavior method.
void ac_behavior( push_32sm ){
  mode = _32irm;
  if (sreg != 2) 
    oset = (uint16_t)(oset + RB.read(sreg));
  PUSH(bw, sreg, oset, DM, RB);
}

//!Instruction push_32am behavior method.
void ac_behavior( push_32am ){
  mode = _32irm;
  if (sreg != 2) 
    oset = (uint16_t)(oset + RB.read(sreg));
  PUSH(bw, sreg, oset, DM, RB);
}

//!Instruction push_32imm behavior method.
void ac_behavior( push_32imm ){
  mode = _32imm;
  if (constant.mode) {
    oset = constant.value;
    constant.mode = false;
  }
  PUSH(bw, sreg, oset, DM, RB);
}

//!Instruction push_32im behavior method.
void ac_behavior( push_32im ){
  mode = _32irm;
  if (sreg != 2) 
    oset = (uint16_t)(oset + RB.read(sreg));
  PUSH(bw, sreg, oset, DM, RB);
}
//@}

/**
 * 
 * @defgroup CALL CALL instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//**********************CALL**********************
//!Instruction call_16rm behavior method.
void ac_behavior( call_16rm ){
  mode = _16rm;
  CALL(bw, sreg, 0, DM, RB, ac_pc);
}

//!Instruction call_16irm behavior method.
void ac_behavior( call_16irm ){
  // trick to save on memory
  // simplification 
  // here indexed register mode is used to 
  // save directly into memory using write_back method 
  mode = _16irm;
  CALL(bw, sreg, 0, DM, RB, ac_pc);
}

//!Instruction call_16iaim behavior method.
void ac_behavior( call_16iaim ){
  mode = _16iaim;
  CALL(bw, sreg, 0, DM, RB, ac_pc);
}

//!Instruction call_32sm behavior method.
void ac_behavior( call_32sm ){
  mode = _32irm;
  CALL(bw, sreg, oset, DM, RB, ac_pc);
}

//!Instruction call_32am behavior method.
void ac_behavior( call_32am ){
  mode = _32irm;
  CALL(bw, sreg, oset, DM, RB, ac_pc);
}

/**
 * @todo fix to all the instructions
 * _32imm has to match all the instructions
 * 
 */
//!Instruction call_32imm behavior method.
void ac_behavior( call_32imm ){
  mode = _32imm;
  CALL(bw, sreg, oset, DM, RB, ac_pc);
}

//!Instruction call_32im behavior method.
void ac_behavior( call_32im ){
  mode = _32irm;
  CALL(bw, sreg, oset, DM, RB, ac_pc);
}
//@}

/**
 * 
 * @defgroup RETI RETI instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//**********************RETI**********************
//!Instruction reti behavior method.
void ac_behavior( reti ){
  RETI(bw, sreg, 0, DM, RB, ac_pc);
}
//@}
//@}
/**
 * 
 * @defgroup JUMP JUMP instruction 
 * 
 * @brief ALL JUMP instructions
 * @{ 
 */
//*****************************************************
//  Jump Instructions
//*****************************************************

//!Instruction jne behavior method.
void ac_behavior( jne ){
  // behavior (PC is incremented)
  int label = RB.read(PC) + offset * 2;
  if (!flags.Z) {
    RB.write(PC, label);
    ac_pc = label;
  }
}


//!Instruction jeq behavior method.
void ac_behavior( jeq ){
  // behavior (PC is incremented)
  int label = RB.read(PC) + offset * 2;
  if (flags.Z) {
    RB.write(PC, label);
    ac_pc = label;
  }
}

//!Instruction jnc behavior method.
void ac_behavior( jnc ){
  // behavior (PC is incremented)
  int label = RB.read(PC) + offset * 2;
  if (!flags.C) {
    RB.write(PC, label);
    ac_pc = label;
  }
}

//!Instruction jc behavior method.
void ac_behavior( jc ){
  // behavior (PC is incremented)
  int label = RB.read(PC) + offset * 2;
  if (flags.C) {
    RB.write(PC, label);
    ac_pc = label;
  }
}

//!Instruction jn behavior method.
void ac_behavior( jn ){
  // behavior (PC is incremented)
  int label = RB.read(PC) + offset * 2;
  if (flags.N) {
    RB.write(PC, label);
    ac_pc = label;
  }
}

//!Instruction jge behavior method.
void ac_behavior( jge ){
  // behavior (PC is incremented)
  int label = RB.read(PC) + offset * 2;
  if ( !(flags.N xor flags.V)) {
    RB.write(PC, label);
    ac_pc = label;
  }
}

//!Instruction jl behavior method.
void ac_behavior( jl ){
  // behavior (PC is incremented)
  int label = RB.read(PC) + offset * 2;
  if ( (flags.N xor flags.V)) {
    RB.write(PC, label);
    ac_pc = label;
  }
}

//!Instruction jmp behavior method.
void ac_behavior( jmp ){
  // behavior (unconditionally)
  int label = RB.read(PC) + offset * 2;

  RB.write(PC, label);
  ac_pc = label;  
}
//@}
